multiphaseEuler/boilingBed/constant/physicalProperties.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          eConst;
    equationOfState rPolynomial;
    specie          specie;
    energy          sensibleInternalEnergy;
}

pressureWorkAlphaLimit 0.01;

mixture
{
    specie
    {
        molWeight       18.0153;
    }

    equationOfState
    {
        C (0.001278 -2.1055e-06 3.9689e-09 4.3772e-13 -2.0225e-16);
    }

    thermodynamics
    {
        hf          0;
        Cv          4195;
        Tref        372.76;
        esRef       417500;
    }

    transport
    {
        mu          2.8291e-4;
        Pr          2.289;
    }
}

// ************************************************************************* //
